let handler = async (m, { conn }) => {
  let who = m.quoted ? m.quoted.sender : m.mentionedJid && m.mentionedJid[0] ? m.mentionedJid[0] : m.fromMe ? conn.user.jid : m.sender
  let pp = ('./Menu.png')
  let { name } = global.db.data.users[who]
  
let str = `*∞───── ☽ 🩵 ☾ ─────∞*

*᥀·࣭࣪̇˖🕊️◗  أهلا يا↜ ${name}*
*⊱───⚘───⊰*
*᥀·࣭࣪̇˖🕊️◗ مطوري 𝑰𝒕𝒔 𝑨𝒉𝒎𝒂𝒅*
*᥀·࣭࣪̇˖🕊️◗ رقمه: http://wa.me/972568155701*
*᥀·࣭࣪̇˖🕊️◗ قروب الدعم: https://chat.whatsapp.com/Gv149AqYJyU22AdoDfrU3i*

*⊱────꒰🩵 ꒱────⊰*
*◞👥◜ أوامر الأعضاء │↶*
*⊱────꒰🩵 ꒱────⊰*

*✪│↜ .المطور*
*✪│↜ .بوت*
*✪│↜ .الدعم* 
*✪│↜ .بروفايل*
*✪│↜ .تسجيل*
*✪│↜ .التوقيت*
*✪│↜ .يومي*
*✪│↜ .بنكي*
*✪│↜ .خط*

*⊱────꒰🩵 ꒱────⊰*
*◞🌀◜ أوامر المجموعات │↶*
*⊱────꒰🩵 ꒱────⊰*

*✪│↜ .منشن*
*✪│↜ .لمنشن*
*✪│↜ .مخفي*
*✪│↜ .المشرفين*
*✪│↜ .الاشباح*
*✪│↜ .الترحيب*
*✪│↜ .الوداع*
*✪│↜ .تغيير-الاسم*
*✪│↜ .تغيير-الصوره*
*✪│↜ .تغيير-الوصف*
*✪│↜ .الرابط*
*✪│↜ .قروب فتح*
*✪│↜ .قروب إغلاق*
*✪│↜ .حذف*
*✪│↜ .اختفاء*
*✪│↜ .انذار*
*✪│↜ .الانذارات*
*✪│↜ .رفع-انذار*

*⊱────꒰🩵 ꒱────⊰*
*◞🎲◜ قائمة الترفيه │↶*
*⊱────꒰🩵 ꒱────⊰*

*✪│↜ .فعالية*
*✪│↜ .هل*
*✪│↜ .تطقيم*
*✪│↜ .قط*
*✪│↜ .كلب*
*✪│↜ .الدون*
*✪│↜ .ميسي*
*✪│↜ .بيكو*
*✪│↜ .توب*
*✪│↜ .تحداني*
*✪│↜ .زواج*
*✪│↜ .طلاق*
*✪│↜ .نسبة*
*✪│↜ .جميل*
*✪│↜ .ميمز*
*✪│↜ .رهان*
*✪│↜ .العب*
*✪│↜ .نرد*
*✪│↜ .شخصية*
*✪│↜ .فزوره*
*✪│↜ .دمج*

*⊱────꒰🩵 ꒱────⊰*
*◞🗂️◜ قائمة التنزيل │↶*
*⊱────꒰🩵 ꒱────⊰*

*✪│↜ .يوتيوب*
*✪│↜ .يوت2*
*✪│↜ .انستا*
*✪│↜ .صورة*
*✪│↜ .بينترست*

*⊱────꒰🩵 ꒱────⊰*
*◞📽️◜ أوامر التحويل │↶*
*⊱────꒰🩵 ꒱────⊰*

*✪│↜ .ملصق*
*✪│↜ .حقوق*
*✪│↜ .لصورة*
*✪│↜ .لفيديو*
*✪│↜ .لصوت*
*✪│↜ .ستك*
*✪│↜ .انطق*
*✪│↜ .تليجراف*
*✪│↜ .جوده*
*✪│↜ .تصميم*

*⊱────꒰🩵 ꒱────⊰*
*◞🕌◜  الأوامر الدينية│↶*
*⊱────꒰🩵 ꒱────⊰*

*✪│↜ .ايات*
*✪│↜ .اذكار الصباح*
*✪│↜ .اذكار المساء*
*✪│↜ .آيه*

*⊱────꒰🩵 ꒱────⊰*
*◞🏦◜ أوامر الأصوات │↶*
*⊱────꒰🩵 ꒱────⊰*

*✪│↜ .تسريع*
*✪│↜ .بطئ*
*✪│↜ .الي*
*✪│↜ .سنجاب*
*✪│↜ .عميق*
*✪│↜ .سلس*
*✪│↜ .تحسين*
*✪│↜ .عكس*
*✪│↜ .منفوخ*

*⊱────꒰🩵 ꒱────⊰*

*◞📍◜ تنبيهات ↶*

*𝟏 ⇜البوت شغال 24 ساعة لكن يطفي أحياناً بسبب الضغط!*
*𝟐⇜ممنوع سب البوت أو المطور!*
*𝟑⇜شكراً، ويوجد الكثير من الأوامر الجديدة استكشفها 🎡*
𝕷𝖆𝖓𝖌𝖆 𝖇𝖔𝖙

*∞───── ☽ 🩵 ☾ ─────∞*`
  conn.sendFile(m.chat, pp, 'darkman.png', str, m, false, { mentions: [who] })
  m.react(done)
}

handler.help = ['main']
handler.tags = ['group']
handler.command = ['الأوامر','الاوامر','اوامر','أوامر','menu','help']

export default handler
